src/main/resources/templates/Rq.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:cb="http://web.cbr.ru/">
    <soap:Header/>
    <soap:Body>
        <cb:GetCursOnDateXML>
            <cb:On_date>${cursOnDate}</cb:On_date>
        </cb:GetCursOnDateXML>
    </soap:Body>
</soap:Envelope>